const ryouya = `予は越後三条の生れなり。父は農と商を兼ねたり。伯父は春庵とて医師なり。余は父よりは伯父に愛せられて、幼きより手習学問のこと、皆な伯父の世話なりし。自ら言うは異な事なれど、予は物覚えよく、一を聞て二三は知るほどなりしゆえ、伯父はなお身を入れてこの子こそ穂垂という家の苗字を世に知らせ、またその生国としてこの地の名をも挙るものなれとて、いよいよ珍重して教えられ、人に逢えばその事を吹聴さるるに予も嬉しき事に思い、ますます学問に身を入れしゆえ、九歳の時に神童と言われ、十三の年に小学校の助教となれり。父の名誉、伯父の面目、予のためには三条の町の町幅も狭きようにて、この所ばかりか近郷の褒め草。ある時、県令学校を巡廻あり。予が講義を聴かれて「天晴慧しき子かな、これまで巡廻せし学校生徒のうちに比べる者なし」と校長に語られたりと。予この事を洩れ聞きてさては我はこの郷に冠たるのみならず、新潟県下第一の俊傑なりしか、この県下に第一ならば全国の英雄が集まる東京に出るとも第二流には落つまじと俄かに気強くなりて、密かに我腕を我と握りて打笑みたり。この頃の考えには学者政治家などという区別の考えはなく、豪傑英雄という字のみ予が胸にはありしなり。さりければなおさらに学問を励み、新たに来る教師には難問をかけて閉口させ、後には父にも伯父にも口を開かせぬ程になり、十五の歳新潟へ出て英学をせしが教師の教うるところ低くして予が心に満足せず。八大家文を読み論語をさえ講義し天下を経綸せんとする者が、オメオメと猿が手を持つ蟻が臑を持つの風船に乗って旅しつつ廻るのと、児戯に類する事を学ばんや。東京に出でばかかる事はあるまじ。龍は深淵にあらねば潜れず、東京へ出て我が才識を研ぎ世を驚かすほどの大功業を建てるか、天下第一の大学者とならんと一詩をのこして新潟の学校を去り在所にかえりて伯父に出京の事を語りしに、伯父は眉を顰め、「東京にて勉学の事は我も汝に望むところなり、しかしまだ早し、卑近なり」とて「字を知り語を覚ゆるだけの方便なり。今二三年は新潟にて英学をなしその上にて東京へ出でよ、学問は所にはよらじ、上磨きだけを東京にてせよ」と止められ、志を屈して一年程は独学したれど、はしる馬の如き出京の志し弱き手綱に繋ぐべきにあらず。十七の春なりし。心を決して父と伯父に乞いもし許されずは出奔せん覚悟を様子にそれと悟りてか、左まで思わば出京せよと許可を得たり。`;
const aika = `文吉は操を渋谷に訪うた。無限の喜と楽と望とは彼の胸に漲るのであった。途中一二人の友人を訪問したのはただこれが口実を作るためである。夜は更け途は濘んでいるがそれにも頓着せず文吉は操を訪問したのである。
    彼が表門に着いた時の心持と云ったら実に何とも云えなかった。嬉しいのだか悲しいのだか恥しいのだか心臓は早鐘を打つごとく息は荒かった。何んでもその時の状態は三分間も彼の記憶に止まらなかったのである。
    彼は門を入って格子戸の方へ進んだが動悸はいよいよ早まり身体はブルブルと顫えた。雨戸は閉って四方は死のごとく静かである。もう寐るのだろうか、イヤそうではない、今ヤット九時を少過ぎたばかりである。それに試験中だから未だ寐ないのには定っている。多分淋しい処だから早くから戸締をしたのだろう。戸を叩こうか、叩いたらきっと開けてくれるには相違ない。しかし彼はこの事をなすことが出来なかった。彼は木像のように息を凝らして突立っている。なぜだろう？　なぜ彼は遥々友を訪問して戸を叩くことが出来ないのだろう？　叩いたからと云って咎められるのでもなければ彼が叩こうとする手を止めるのでもない、ただ彼は叩く勇気がないのである。ああ彼は今明日の試験準備に余念ないのであろう。彼は吾が今ここに立っているということは夢想しないのであろう。彼と吾とただ二重の壁に隔たれて万里の外の思をするのである。ああどうしよう、せっかくの望も喜も春の雪と消え失せてしまった。ああこのままここを辞せねばならぬのか。彼の胸には失望と苦痛とが沸き立った。仕方なく彼は踵を返して忍足でここを退った。`;
const shidou = `鉄道聯隊の兵隊さんを指導することになった。私には本当に久し振りであった。なんでも運転係の助役さんの話では、今度は特別よい機関士ばかりを指導者に選んだと云うことだが、私にしても大変嬉しいわけである。私もこれで三十年近くも機関士をやっているのだから、例えばその兵隊さんがずぶの素人でも、大した頭の持ち主でなくとも、立派に一人前にしてやらなければならない。僅か三ヶ月やそこいらで、機関車を動かせるようにしろなんて無茶だ、と云うものもないではないが、この時局を考えたら、出来るかどうかやってみるより外に仕方がないだろう。それにまた考えようでは、どの兵隊さんもやがて戦地へ行く体だし、単に気がまえの点から云っても、平和の頃とは大分違っている筈である。こっちの出方では呼吸もぴったり合うにちがいない。いや合わせなければならない。そうすれば石炭を焚くスコップの扱いかたが悪いと云っても、制動機の使いかたに文句を並べても、お互いにまずい感情にも捕われないで済むだろう。正直なところ、私もこの年齢では戦場へも行けないし、子供は娘ばかりで兵隊にもやれないのだから、せめて可能の仕事を積極的にやり、幾らかでも非常時のお役に立ちたい、と云う決心をかためていた際でもあり、自然に仕事への張りも出て来たようである。`;

export const presets = [
    {
        label: '饗庭篁村 - 良夜', value: ryouya
    },
    {
        label: '李光洙 - 愛か', value: aika },
    {
        label: '上田広 - 指導物語', value: shidou },
    { label: 'Custom', value: 'custom' }
];